In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Users')

+---------+-------+
| user_id |  name |
+---------+-------+
|    1    | aLice |
|    2    |  bOB  |
+---------+-------+

### Fix the names so that only the first character is uppercase and the rest are lowercase.

#### *Return the result table ordered by user_id.*

```
+---------+-------+
| user_id | name  |
+---------+-------+
| 1       | Alice |
| 2       | Bob   |
+---------+-------+
```

In [3]:
%%sql 

SELECT 
    UPPER(name)
FROM Users;

[('ALICE',), ('BOB',)]

In [4]:
%%sql 

SELECT
    UPPER(SUBSTR(name, 1, 1)),
    LOWER(SUBSTR(name, 2))
FROM Users

[('A', 'lice'), ('B', 'ob')]

In [5]:
%%sql 

SELECT 
    user_id,
    CONCAT(UPPER(SUBSTR(name, 1, 1)), LOWER(SUBSTR(name, 2))) AS name
FROM Users
ORDER BY user_id;

[(1, 'Alice'), (2, 'Bob')]

# Using Pandas

In [6]:
users_query = %sql SELECT * FROM Users # type: ignore
users_df = users_query.DataFrame()

display(users_df)

   user_id   name
0        1  aLice
1        2    bOB

In [7]:
users_df['name'].str.capitalize()

0    Alice
1      Bob
Name: name, dtype: object

In [8]:
users_df['name'] = users_df['name'].str.capitalize()
users_df.sort_values('user_id')

users_df

   user_id   name
0        1  Alice
1        2    Bob